<!-- placeholder-1 -->
```fish
terraform plan -chdir=./ -var-file=./vars.tfvars
```
<!-- placeholder-2 -->

<details><summary>Diff of 8 changes.</summary>

```diff
~ module.kube-hetzner.data.cloudinit_config.autoscaler_config[0] will be read during apply
# (depends on a resource or a module with changes pending)
! module.kube-hetzner.hcloud_ssh_key.k3s[0] must be replaced
+ module.kube-hetzner.local_file.kustomization_backup[0] will be created
! module.kube-hetzner.null_resource.configure_autoscaler[0] must be replaced
! module.kube-hetzner.ssh_sensitive_resource.kubeconfig will be updated in-place
~ module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].data.cloudinit_config.config will be read during apply
# (depends on a resource or a module with changes pending)
~ module.kube-hetzner.module.control_planes["0-1-control-plane-hel1"].data.cloudinit_config.config will be read during apply
# (depends on a resource or a module with changes pending)
~ module.kube-hetzner.module.control_planes["0-2-control-plane-hel1"].data.cloudinit_config.config will be read during apply
# (depends on a resource or a module with changes pending)
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 3 to add, 1 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @tonitert at 2025-09-13T22:03:27Z [(view log)](https://github.com/tonitert/ad-infra-k3s/actions/runs/17702577321/job/50310089831#step:7:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.kube-hetzner.data.cloudinit_config.autoscaler_config[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "autoscaler_config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (sensitive value)
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.hcloud_ssh_key.k3s[0] must be replaced
-/+ resource "hcloud_ssh_key" "k3s" {
      ~ fingerprint = "5c:2b:fc:4d:ca:c3:48:da:b1:44:1f:fa:e2:b3:2e:c6" -> (known after apply)
      ~ id          = "101582983" -> (known after apply)
        name        = "k3s"
      ~ public_key  = <<-EOT # forces replacement
          - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPxx9gWelsnyCU+WJ95XovyNPgr3TYrByhOr54kl5ukV tonit@Toni2017-PC
          + ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILaiupGNkw2Gzb6AcCtpB9OhYu55hBGF9qIjh6XDKj+Q runner@runner
        EOT
        # (1 unchanged attribute hidden)
    }

  # module.kube-hetzner.local_file.kustomization_backup[0] will be created
  + resource "local_file" "kustomization_backup" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "600"
      + filename             = "k3s_kustomization_backup.yaml"
      + id                   = (known after apply)
    }

  # module.kube-hetzner.null_resource.configure_autoscaler[0] must be replaced
-/+ resource "null_resource" "configure_autoscaler" {
      ~ id       = "8994444481530202858" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "template" = <<-EOT
                ---
                apiVersion: v1
                kind: ServiceAccount
                metadata:
                  labels:
                    k8s-addon: cluster-autoscaler.addons.k8s.io
                    k8s-app: cluster-autoscaler
                  name: cluster-autoscaler
                  namespace: kube-system
                ---
                apiVersion: rbac.authorization.k8s.io/v1
                kind: ClusterRole
                metadata:
                  name: cluster-autoscaler
                  labels:
                    k8s-addon: cluster-autoscaler.addons.k8s.io
                    k8s-app: cluster-autoscaler
                rules:
                  - apiGroups: [""]
                    resources: ["events", "endpoints"]
                    verbs: ["create", "patch"]
                  - apiGroups: [""]
                    resources: ["pods/eviction"]
                    verbs: ["create"]
                  - apiGroups: [""]
                    resources: ["pods/status"]
                    verbs: ["update"]
                  - apiGroups: [""]
                    resources: ["endpoints"]
                    resourceNames: ["cluster-autoscaler"]
                    verbs: ["get", "update"]
                  - apiGroups: [""]
                    resources: ["nodes"]
                    verbs: ["watch", "list", "get", "update"]
                  - apiGroups: [""]
                    resources:
                      - "namespaces"
                      - "pods"
                      - "services"
                      - "replicationcontrollers"
                      - "persistentvolumeclaims"
                      - "persistentvolumes"
                      - "volumeattachments"
                    verbs: ["watch", "list", "get"]
                  - apiGroups: ["extensions"]
                    resources: ["replicasets", "daemonsets"]
                    verbs: ["watch", "list", "get"]
                  - apiGroups: ["policy"]
                    resources: ["poddisruptionbudgets"]
                    verbs: ["watch", "list"]
                  - apiGroups: ["apps"]
                    resources: ["statefulsets", "replicasets", "daemonsets"]
                    verbs: ["watch", "list", "get"]
                  - apiGroups: ["storage.k8s.io"]
                    resources: ["storageclasses", "csinodes", "csistoragecapacities", "csidrivers"]
                    verbs: ["watch", "list", "get"]
                  - apiGroups: ["batch", "extensions"]
                    resources: ["jobs"]
                    verbs: ["get", "list", "watch", "patch"]
                  - apiGroups: ["coordination.k8s.io"]
                    resources: ["leases"]
                    verbs: ["create"]
                  - apiGroups: ["coordination.k8s.io"]
                    resourceNames: ["cluster-autoscaler"]
                    resources: ["leases"]
                    verbs: ["get", "update"]
                ---
                apiVersion: rbac.authorization.k8s.io/v1
                kind: Role
                metadata:
                  name: cluster-autoscaler
                  namespace: kube-system
                  labels:
                    k8s-addon: cluster-autoscaler.addons.k8s.io
                    k8s-app: cluster-autoscaler
                rules:
                  - apiGroups: [""]
                    resources: ["configmaps"]
                    verbs: ["create","list","watch"]
                  - apiGroups: [""]
                    resources: ["configmaps"]
                    resourceNames: ["cluster-autoscaler-status", "cluster-autoscaler-priority-expander"]
                    verbs: ["delete", "get", "update", "watch"]
                
                ---
                apiVersion: rbac.authorization.k8s.io/v1
                kind: ClusterRoleBinding
                metadata:
                  name: cluster-autoscaler
                  labels:
                    k8s-addon: cluster-autoscaler.addons.k8s.io
                    k8s-app: cluster-autoscaler
                roleRef:
                  apiGroup: rbac.authorization.k8s.io
                  kind: ClusterRole
                  name: cluster-autoscaler
                subjects:
                  - kind: ServiceAccount
                    name: cluster-autoscaler
                    namespace: kube-system
                
                ---
                apiVersion: rbac.authorization.k8s.io/v1
                kind: RoleBinding
                metadata:
                  name: cluster-autoscaler
                  namespace: kube-system
                  labels:
                    k8s-addon: cluster-autoscaler.addons.k8s.io
                    k8s-app: cluster-autoscaler
                roleRef:
                  apiGroup: rbac.authorization.k8s.io
                  kind: Role
                  name: cluster-autoscaler
                subjects:
                  - kind: ServiceAccount
                    name: cluster-autoscaler
                    namespace: kube-system
                
                ---
                apiVersion: apps/v1
                kind: Deployment
                metadata:
                  name: cluster-autoscaler
                  namespace: kube-system
                  labels:
                    app: cluster-autoscaler
                spec:
                  replicas: 1
                  selector:
                    matchLabels:
                      app: cluster-autoscaler
                  template:
                    metadata:
                      labels:
                        app: cluster-autoscaler
                      annotations:
                        prometheus.io/scrape: 'true'
                        prometheus.io/port: '8085'
                    spec:
                      serviceAccountName: cluster-autoscaler
                      tolerations:
                        - effect: NoSchedule
                          key: node-role.kubernetes.io/control-plane
                
                      # Node affinity is used to force cluster-autoscaler to stick
                      # to the control-plane node. This allows the cluster to reliably downscale
                      # to zero worker nodes when needed.
                      affinity:
                        nodeAffinity:
                          requiredDuringSchedulingIgnoredDuringExecution:
                            nodeSelectorTerms:
                              - matchExpressions:
                                  - key: node-role.kubernetes.io/control-plane
                                    operator: Exists
                      containers:
                        - image: registry.k8s.io/autoscaling/cluster-autoscaler:v1.32.0
                          name: cluster-autoscaler
                          resources:
                            limits:
                              cpu: 100m
                              memory: 300Mi
                            requests:
                              cpu: 100m
                              memory: 300Mi
                          ports:
                            - containerPort: 8085
                          command:
                            - ./cluster-autoscaler
                            - --v=4
                            - --logtostderr=true
                            - --stderrthreshold=INFO
                            - --cloud-provider=hetzner
                            - --nodes=0:2:cx32:hel1:k3s-autoscaled-small
                          env:
                          - name: HCLOUD_TOKEN
                            valueFrom:
                                secretKeyRef:
                                  name: hcloud
                                  key: token
                          - name: HCLOUD_CLOUD_INIT
                            value: 
                          - name: HCLOUD_CLUSTER_CONFIG
                            value: eyJpbWFnZXNGb3JBcmNoIjp7ImFtZDY0IjoiMzA2NTUzMjc5IiwiYXJtNjQiOiIzMDY1NTI5MjgifSwibm9kZUNvbmZpZ3MiOnsiazNzLWF1dG9zY2FsZWQtc21hbGwiOnsiY2xvdWRJbml0IjoiSDRzSUFBQUFBQUFBLzhSN2UzUGF5TDdnLzFTZDc5Q0hwSzZUSGRzZ1laTGdYTTlla0VFSUF6WlBJWjJkcFZwU1cycG9QYTY2QllqTWZQZXRiZ25NdzNabVR0MXpOaW5iU1AxN3YxdTBsREJnS0dCWDR6UkN0OEJQQ01NUmpGbkp4eHZrZkFkV21BUU9qTk83WWsvck5SdVBrLzU5ZldnVUMvenFhb3BpaXNQZ0Zralg1YjhWL2xhNHVqb0UrbHRoUi9zZTB5aWttQWxZeUJpMFBSOEY3RHQ0eGdRRjBFZDNSUnhnZG0wL3U4VVhySEVNQS9xTTRxdG1ZSWNPRHR4YjhOWEM3QUJBaU16UWhwVnNFaWJPbFIwR3o5ajlXNkdIZlhRbTNJZERtRUxCUVZiaTNvSnhuS0JDWVIxamh1WmNHbnBiS0h3QUl6dkdFUU1zQkxHUUR6QVBnU2pHSzhnUXdBRkQ4VE8wRVY5SHpKTUFEQnlRQlBnNUJYM0UxbUc4N01FQXVpZ0dkaGdFeU9aNmd3RDZPSEFMVnlDQ3pMc0ZKY1RzVE9wU3htSytKM3ROdlFMZ3FGekpXL0I3QVFBQVB2eTlaT0dnWkVHeENBQkZERnloSkFRUmp0QXp4S1NRM1NZSVJVQ1NzcXNQWUJUNnlBdlhnSVkrWXRoSEZJVEJUcEVySElFd0lDbW5sVVQwVWlpWjQ3M282TU1VUUJJajZLVEFRc0FPNHhqWmpLUmNJVVF2aGU3TXd6Ukh0RWhvTHdIMXdvUTRISjR1Y1JRaDUxb3M0MmZ3ZDRBalFIQWdZTmJDZk44NTQwQUFjQXBqdUVRZ0R0ZkFRaTRPQWh5NFlJMlpCeW9jSFcwd1pmUVN5Q0JrSG9yWG1DTHdDVDluZXNBWEYwV2ZjM3BhZjl3Y3R1cEs4KzdqcHlQT3Z3TTNSaEc0V29HTFp3S0RBSkVMOER1QTZ5VzRhRFJWcmYrRFZPNkt4VCsrZzlML3JkeVcrTlZIV1Z6Si9Fck9ycHI5K3gvNCtST3AvUDJ1V1B6TTJRY01rTXAzZ0FoRnUwdjVEMDZaSWdkYzBOSnRxZVJlN0lUcjFaVzdqNTlzeUVDSnByUmtFMGhwS1VDczlIRXZkZ2s2VG93by9WekljZkF6K0Fjb3ZnQVV3UjBvY2pNV3dXOUhsZ1FBMlY0SWl0cmVsUzlJZTQ5R0lRNFk1WUg4c1ZkWExqTjM0Y0M5dnI0dXZ0RFpZQWJLK2VVekx2eUxYUFVCNkZNd2JQWWVwMDN3NjN1TysvYzY2VmlzZjhabEhQby8vN1A1MkFLL1pubWZPR2hWaWhPQzZMVlQrbHEraW5pcG9xS21CWWhkaTVVY2R6UnBqSXpSdU5tN3V5c0dpQlV2UVYwWmE0Lzl1N3NpZEp6aUpiZ2ZhdFBtY0hSM1YvemYvNHV2anNmREg3a0FmOXpkRmJsYmk1ZWdYKzgxNzdJd0VZU2JqNjE5UU8yTWk5aGhoRGpoT25nZlFoUkdUdklWTUZFV2s2aHdHREYrR3FNSVFRWStmUVkvOXNIMUFTaEpIS09BQVY2ZndDK2dVaTREaXV3d2NDajRWQVUrRGhLRzZPYzlBZ2x0U0xoVDU2T204dGkvSDkxOS9QUXAvNWloZjM0QlhudVlJTURpQkgwSFRyaS96Zi85K2g5eW5pRWtES1BpMFJwK0JwOCtnZUxIbkd3Ui9BcUtIdzlZRnNIbnp5ZkpkazZXNnhNbURNUUkyaDV5aW1lZ0lxK2tvOXZQK09qeUE0aVRBTmloNy9NeXkzOXNEOWxMRUNPV3hIekJRYWR5Zi93djhGUEpyQmpCNWJrODR2YlJYWjRoNzlCeFF3WjQ3MGxpbENuREJib0VtWnR4NEo2enlQcFQrYnI2bHRaT0dHUWMvM2dKR2hGb1IwR1R4UUJpM2wzeG8xUTh2ejEvYWJ5RmcwalRBbUJEaWtENC9GS0Fya1E5Q3JLK2ZjbVJ5NkxuQlNITFNsamh3TGhIaGFqNEVUR3ZDUDdqMXhKUDV5QWg1QlhESHd0ejkvRlQ0TnNFZ3lzWHFNMStjMWp2WGl1UC9YNVQ1RFJ3MEFyYjZJajY3NzludHI2NCtIeEVOeU56TUYvNG9jTUhFSUYyd0xFSS9zK0pFK3d3dUJJV3pUbThzcDdqWHUrbmdFT0V3b25YL2pqSjdyM0h1Q25mWHNwSEZKcFNobnliRVJBanltRE1Ua2FvQWdBUmluMU0rU3hIYjBHeC9QWG1wc2hudEh0TW9VVVFvTlFERWFSMEhjWU9nQW4zQU1NMkZMNi9PaDJqbnNLWUFWbk9QdWRJOVNNY0VHUmxZaVpKclRCZXc1aFBucnViUGJqaDBPTVlJd295S25WQ3d2WFlqczZCeFVyZFJRRjdaUzFoWGhqakxYSWVVRXBidkVoZFUrcVY0UDcrZklsUzNnUU94a1VPUUtubnpMTVo5dG9wTFJNTFhYbUliUU1VWC9PN1luaEZ2T1pZWWNpQWo1Z1hPZ0JTVUZ3bU1hOUJaeFlaTmh1UGorTjVyemx1UDk3ZkNhaGpyb3lQNFZBRUJDUlhTZVJBaHZhOGxCanhKajZFZ2UyaG1HZCtDUElKKzR6VFArSU02bXBab1ZlOHBvWEJGV1hjaDcrSmRiRVIyRkY2cUZDZ0NCandLUVBLNHQrQ0ZDVXh1Zk1ZaStodHFSUkgvblZPOXhxSHBXV0Zsakx3VXNhaDVHTTdEa05hQ2tJWTI5bnNqQUlPNE54bHBkZU5YRkZVODB1dXdueC9yN3dEV2FMMExaNVJZaEZzWHk5UmVteTRiUnBGSlU2T2QvbHozYS81MG9FTitmVE4vVG5QL1RtbmlPQWcyVnd6SlBaSmZENkhERUFlVlJUZ0FJeWFYYjdPaHpkZXJMSmtSVEhLWnJBVmpIR1lVQkFnNUNBSFVCVHoya0pmTmlCeEdMTFNHd3pQOXg5KzZDVGtkUUg1QnV0N0lUZmVmeWM0UmdlVm1xVVJBa3NVQjRqTTJTV3djTUQvNURkY0ZLQVkyM01Qa1FqRmZBRlRtMkxuNEJQYUlKdGZybUE4ajVOZzk1RmdhODR1ajN0ZmdCbGZUZ0lDTFVTUW9KS1ZGMmRPUWhjSFIzZThrREllY2VJbVZ4YmlRTWh3Uk5SR01Uc0dlT0VPRUJPaUpUUStCdUhlT3I1RFF2ZU04bjZSZWpBK2dZK1RnRThQZSszUFYzWjJFSVJCRkljQ0RvZnpKTWFCdVBlY1VEVFBPZ3EvNU1FN2owS2h6aHVDN0czOGZROGc1bHV3UkNuNHdlY1lCNnd3V29NL1RnRzR4dUFIQ0NNVVpHQmM4SVNoM2Q5NUVNNUZIUUYyRnV5aWk0cXRZdDRSeEE0Y3dDaENBUTlXQmhtTHVTczVuSnRmcmlHenZYUG1OTFNYODF5Q0RDUWpsclBLaVp5aEpRSGV6QjAzaHY2Y1UwQXNSM2dWanJJWXZRRCsyRFZKOFlBQU9qbkRNeFlPanNFUEFCMW5MblRNQmRxcGMyZ0Q2T3dNRVNNL1hLRjUvam1DWWpTT2ZVN3F4Q3dVOFlxVzgzN0ROaVRZbTBZd3lVVTR0NkhJaWp6TDV6eU5FVDBMQS9GOEpBT0VsSVkyZnNWYVZ2UU1mQmpOWDdmbExqNEIvZThvSk9SMEdRWmhNTWRCNkhCNWMxRjlHTDFyWTJaSE83ZUl4eWk1WjA3QmJDK2VuMFhwRWNsOGp2bHdkL2p2clVvRmpxRHVCS2Fvekc4aWlNcDNLMFE0VFlydmZ3SjlWMEp2MzhqRjk3RXBJcyszYndmOGE0cnZLdkhibXU0aGprcjFrWXJmWHdQZmw1bmJsOHdWbnZnSjlDdUp1RS9ETjNRUUxlRWREYkwxZzQ1eGU1S3lSOW1ZSjZISXVpT3p2MEpubjNpSGlYQUVmZEJ6YnM4aTh6WHlwdzFtaC9WbXJYMk55RkZYdVAxNVZod2hIL1NRMnpmejdqVkhuTGJodDExeUJubnFuTXorNzdNNTZPMC81M1FJL0ZlWUhmanZiU2FIUUQveWFlSjBMZ0IvQ0Y3Yzl0Ly9PdW8rME43RHo3QnZEenVCOFBjZmJ5S2N6enZ2cFVZV01xOTBtRDlIT1pjcjcvNDVoZE9BelB0ajludzU3NFR1Y1VkOGs2bVkxSDZ1UU02WnZqWnZ2RVUwbC8wRU5SZm9sVlE2cDNBNHY3dzZzNXdqaXBIelZKOS81WGp4RTBsZWRlQ3VMcjB2MEYrejJGczE4RFJZY2tsMnJIZE1CUGMvVC95Z1AvRlErRG1lU01xL0tOTlBvdXhzbjVDNy9aRHdheEg5RndnZWxvVjNSdWYzU0IxdldJNG92dG1lL213RjJtOTVYcHNBM2gvRno4bnU1NmgzSnQ1enJQMVc2elRuZHFYcG9KSUlkNTQzOGRmSkhhZTlDTStYc05sSGlHQnlzaGw2bi9qL1lNSCtONWJwYkJ0NysvWSs0eHhGVExhdmJUcmVBSDExQjNJTys3S1J2djN6bTVLZk5idHNqUDJwVi80U3RlTUFlbkZHN29iVHFucnl1S2xDUVl4Y1RKbDRvQ2xvNGVmOGtkRUI3Q3R3aDQvM3RMcVllZEQrYTNvTFV2VGw1dmhwV1A0QVREeWhlNkYxblVLZkZBcUZJM0srU1EyOW1wajZta0hkOUF4NWdoOXhIWnV6WWRnYmFRK2F6eVREbjFKek5tREdyQk5vaS9DaE82cGpROTZzSEgzQTdIWm41ZmhrYWM2MG1qbnp5dWFza3hqNkdpdTQ3R3FCdWJMYVUyYU9wTFhWbmdaUXYyR21TdEtuVVUwMlp0cktVZ251eW52Nks4ZXZVVWVYaUsxdUpGTW1pWjFxZ2hlc1RMRTVrbEp6MWlkMllCTHpYbHJZN1VtdFAyNndyaW9SUzYrbGFGemU5dTRiZlRqYUVGdjFpS1ZQVTBOZk03c3lYTmwrS3pESDVjMVFYdVp5OWF0MlpVaXNWMmoyRnBPMU5kb3dVNWRXZHJDczliYjE5VmpuZUozRWtvZWtxMjg4THUvT0RuRGIzODRxMDdWWjZYaW1PcWs1N1k1a2pqSzVMYisyTkVmVjJORTd4UGFyeEZHbjI2NVBWdDFLWjJXcGs1cXRUajJZU2hXcjBva3R0ZWFaN2Q0TG45blFnM3Exdk9QelQ5RDZNdlpyTGFST0Y4NXNTRFEzeExZOHBWQ3ZTa2pSdm1qdFllcm9rd2N0eVBTM3NmWkZVenFoMHg2dTdXMjQ2bTZiNis1Q2svcWptM1YzMFZ6M3hxSGN2eDlzT1IxSHJjV21maVBpeFBacjBxQThKTER0VlkxbGVkdHZOOWFXMytwUFphS2lablU3bGttcWswRnF0YWZKc04xWjlQMW9PR3FUbTRudTlIcmxDR3B1K0g0NE16OHE1WS9ncy9BOUNGNWJucFkxUlNLb0hxN00yWERSbGZ2VXFreVgzVXFIV0g2TG1kTmFaQVZEWXZzaXNCTmJkaDhzblMzaFRITzdzN3JibGFkbEk2MmxobDVkUUhXYWRtVzZ0ZGVScFNtU3J5bTFzaldycnd5NWxwZytDYm9COFN4OTdjNUdkYitERzh6QjlaV2pTdXV1M0Y5WnZobVphYlZxNkJMVmxCcHgxQjRQdXNTUVBXTGpXdHlyOUU3cFBCaXl4eXg1NFBidWpYVlBxV2Z5VnpxZTVmZERjNmF0ZUdDZDBsWUlkYnY2NUhXNVU4RW5RWHFMV1VyRDBSVEQxOVRwRFp3TjNGNDlXaGl6Z2Z1MHVObmhFaXN3STl1dkpaWStUUnlsL3UycE9YMGF1dUhEY0ZKVGxhQlBIS1hPakRGMWJia20yWDZmN1BReTlhb01aNTJWNVV2RUNnWmZ0YmFBalkweGZWRDh2dWNvOVYvMk5taDNWcVpQcURtcUxydmIrcnFydHlqVVc5dHUwQSsxKy9VM3djdlA3bWtxcllsRTEvdGxxeDYxeG1YampKN2h0N2F3VlZ0WXNyUzIxR2taNnJXazZ3OVdlN3k5SGxGazRnYUhZNFplWFdxS0pHdXFLRFFMUjEyN1Q3aTJOR2ZHeWdxbTFMcW5yc01MaGh1NldydS9jbWFkaFRtcWYzczRnRGZrR3JQVkRYRlVzckp3QXh1emZ2Z3dDRjFON2Erc1dZT2FQTUVVYWFXcFEyTDZMY2xxRDl6dXhIQm5VbTNycUszVWFkVkU0aHFWSWRWVSttRDZ5OHpPYnJqUVdvN0hmV1Q2dFZSclZvblRkbGEyei9xR1h2Vk1lWnBxN2VGS1V6dEVhM2VJb1ErcmlrOThUV202amtxWXFkY2tSNm5MUFNXVFNWT2toYVk0a2hVTUkwdHBiTkdzWHpaMVNlZ0FaejFtNlAweW5KbEVVOHJNbmswamN6Wnd4LzYwN01pMUZKWWx6K0tGY3FaOTFWVE9jN3FBNmpkWEkxeStZV1Q1OXArV3NZdHZFbTNCWTJkRHpGbmQ3UzJvYTZxMXhCelpYN1gyTURUMW13ZE5hUkJEOWxhYTBtbE5TT2Rwc2doZms0WEw3VnArcmF5cHJZV2pFdGtjTlR5VDV6UnVsS0V1RWFzeUxXdTQva3Rub1FtYVNDVmw3Yjd1YWtyUEhhcTFwRlBodG0xeGV5d3N0U2FaaWhSWlBpa3J2aGtwdU9jT2VRM2hNbzBhUzFNM1BVZmZsRFdWSkk0NlRVMi90VEFIVVdlNGJOMFB4K1hsZzByV0dtOTQzTi90Zm1oVmJOZFVwNzR4bTFKSHFhZEhjYVUwdm1scXF3TFRldENWcW52YTNaVFhqL3JLVktkeU4yMTg1VFo5VUplMTNwaEZUL2ZTNDNEQm9vZVVScHBLL0FkbEdEMk55NWpEYW5qcG9rb2pGVTFCR1lSd1JEY1BZK3FhTXk5eTJsS3RreTRmb0c2NGVscG5DTmR4cDBuVXdhVGYwbkREZVV3YlphaE9Fd1hYWFMxdHFJYStvWWJmV3NCdDZEcnRUalh6bjBNY3BlRlp3ZExsUE14Wnh6ZjBQdUcyTVdhRHdFNGJrczNYL1lFTFZaNnZyVVJya2dHbk9acVlqVUY1VXVzb1htUXJqWlQ3eEJ3MXRsQ3RWYlI3N1pldVBDUU9yaVdPdnFGYWUrMGFNeWZXRk52N2Q5bUY1OXZPTnRZN3RobVVhNC9qNWZSKzJpUlA0d1gzZDVVWjhpYlNGQ25RbWs1cnZKeU9CcE4xY2dTSEcwdHpaa2FHUEhGdDJWczU2U0g5MTJMQ0k0WStjTHZqWnNSNUhzdlZmeG92cTYyQk5PeU15emRZYTVVUDhtVVgwMlJyNkIzSzg4Q1pEVmZkeWZCeGtqWjhxNks1aGw4clE2V3h0djFhMmVLOW85MXpIZGtqRm00c25GbS9iTWxsZDlpc2pubk5GazAvNkxuR2pPY3Q5NWtabWVwMEtXSkVhU1NXM3Fkd3hHdm9qV3ZwdGFXbWFNdGp2WGx1TnVTK1VvMU11YnF5L1Frelp0T3lsVXBMSytpNVNKOXVOWldzbllXUlFOMUpyRXFIZFBXVzVLamZtS2xXdDFxYkVIc2R1bHd2eTVjV2xycmtkVGJSVkdsbEtxL1lRdEFhSkFMM3ZwbjBSamViN3FKSkg1V2JtKzdDVFI3cmY1V1drZFBTNU42OThhVi9iNjk3OTJHNXY2MnZIeGZocGpkdWJyZ3RlT3p3SDd0Q3RvNDZaYUtHdHp2RXJndzlPM2kxZmo1b2FlUGVrcXMrMUIzSjlpY3VINUljbFNSbTdxZVJPaTBqdjhwcldHTE9obUpvMHhSUCtJMzNNZDdYTkxVVkdEcEo3TXJBSFRhOSs0blNXRUMxbFpneXQydkw1L1ZKYTdZa002MXZlcU8xMjF2VTAvNW8rWkROUkl4b1NuMmhOWWNyQ3p0bFRUVTlxSzlGckdXeWNCcDhOdWlYUlE5cTlrTlQ3OGM4dHpUZVYrK2JJbi9zeW5DcktSN3ZZWW1wdGxKVGFXek4yWkRYZ1FxY0RVT3QzWkFNZnhNWmFUM21NUVJucHVlb0UzYzBiV3dmQnFJSDgzckFoODU0WHkvRnhxTHV2OW1EbFo0NzBJZkx3MTZheVR4eEhaOTRoM3lzbmUzVFhCN1ZpMHpaZFMxOVdyWjlzc2pyWGQrY0RWT285N2lOTnIzN3BtdnByYktZelZLZUY1M1U1TFdqT2RRR1V2MWxRNk8vOEJWOUwrdjFucU1TRFBWTjVMU1h2TjhjMWp2UFZBY0gvYUFoUTczcDlzYjFwS2VJSWRvVjlTcTM3MDVHN1Y1Yjk4YjF6V21kNUxMbjhoL0YwbXM5MGxHL3Vic2N5L1U0bEdNbkg1OWQxclpQWklQM3I2TWV4MmNaNG12dGZHTWtacWxHWktlU1oxU0drZU5QM081STJqZzY0VDNpY1Jlelk3MlZHTHBEN01XaC8rcnVlQ2s5aTFyeFQ5ZlFCbkZVOTh3bXZIZEFkZXFaU3AzMVJzdXNKbks1VzN3dXZuRTFQSHdjVDJ2MzQzTDE4YXp2N1dDVjVsR05zTVNNSitZNlpzbkR5QXlXcDNRaXUyMlV1M3pUNVUvVHJ2NFNsNkxHM2Q5a1BVdXVTcGJLOC9ERzc0MlA3Wkh4ZnBtbmJML0s1Nmt2V3BQbjVZYVlTcU5zcFR5M0JydWFtcGd6dmltVERtWVNYaE5FN0NSYWF4am1jOUhTSERXWU1WdTZoajl4RGQzMGVmM2dzV3NFeThNNjB4dzErd05ON1llR1hnM01XUzk1bVpreStYaU4yOHVhTmhwV3U3OFNNYy8zSDVWcGFvNGFuVW5ia0xOWm9icHlsSVpreTVNOG54dWVuUjdNVC9tTTlEOWdkL25mYW5mOC85SHVxaGtkOXB2ZEhzd2NSQzl6N24zenB0ZnV1VjI1RTFtNHRvVjhqNWJXQTBmMklrdWR1TnFvc1laNk5SRDdnUHVtdSsrTlN2MDRqKzYxWHpxTDVzbWNuODN1bW1xdWJOemdlMGsrQi9MYVR5MjFsZTIxbEViRjBFbFo4TWpnUEszZGx3eTVUK3hLMzNmMDlhbHZ1WDNMVUozc1pzckVuQTJTTHI3QmoybGphNmxUWWl0MTZURnRMQzI1U2g3VGZFL1E1SEZYNWZzbFlpcjJnMUdacHBaU1o3WnM5alRWS3p2dHh2WVJmMXVaOHJUYzlmbmV0eHBaYWVPYjFpU1BFMm5ZR0RjM3o2TnRmenlUK3QzUnRQSE03MDNJSUg4NDAraU1TWDh5bUd4NnN6TGRUcVRhZUZRbWc1blViNDJiNUhFNjlaNG5wTkYvbW9rSEpPNW9VaDFQbTYzZXVGWHI5cVQrODZEc05mZ3NNYjZYNU43b1p0dEx6K2kxOU9iMC9tbms4TDBSMzFzSHZQZHBTdm1oVytsanFOK3NiSG5LWTE3aVB1dk9ETGVyTDkxdVpicTF1VTk1bngzVnRxYStpYXhnZXRPdE5EeERacHpXTnR2blY5ZDJQVXBOUHM5Vk9rVE1PWHgvcTlRa3U2S3RMTFcyTVBUMXl2Qkprai9QT05vSDd1WVc4WHhCYndXODk3MzdBR1lGNDFJVW96a09LSU9FbFBLLzRuQWRkRkhBcnFsWEtId0E5U2dpS2JqdmozWm5FbjF4cUhRZUl4cVNsVGhHZVNzT2h4Y083eFN5bzRnVXhTc1UwMXZ4TVBZS1NOZmlmMzcxN1ZyOHo2L2tMK1V2dHpkZnkrWHMxNjBrU1pMZzd6amllT3JMcVU0Z1RuVlM2czFQVG5weU5sY2MrQW81Y3JVcTFVQzlYcThybGY0V0toSXg3eldwUDI1VytUM3RhYk9wdVRvaU5FaVZ5Uzk2cDFhZGhhdTAvK1RHbGJFUk4xTHZNYTdlTEVrMVdVNEJDd1BNL21zY0JsZ3VTMSt2bnBUQ3Y1SVAveDNaWFBNaG9uaUxoS2N1eGVuRTBpV0FWSnhndktEaTJUT0JsSUVJeGt5OEZnWndBSHJZanNQSEVjQStkTkYxd1kzRE5WL1BISkFkV2FDMzRCOUZUclQ0RytmU2cwc0VhQkpuVDdOM1grUURUTVU3Q1B0WGxRcTdsVnZ1aVpEYWtLQzRFTVdaaStjdnF5SVVDbkVTMkw0ajNnTkRRVTRkTXFFTFNDaWk0RGtoQk1BVnhFUWNRSFl3WFFLdXJqaWhHU3pGNnpRV2k1K3BlREdLaTRNZ1RRdFg0Qi9pN2lXNGVQbUc0K0lTWE1UQ1dQeVREemY4RDJkMUlUVGNuZkY4T1FNTm5zTllxRHNhdFFFa0RNVUJaSGlGUUJUR3JIRHcwRjY4TVNBU2dFTUh5RWFVd2pqZGs4eFBkSEp5aDhlSXVaamk3R3UyZmdrdXJucGNwaXNoNmxVbzVIdjc3S2dmT2orQllPamlOODdrZ3FMOHk3Y0kya3Zvb2o5RlA0cGVoUG1KR0lMTGpnbEh3aitubmVNd2lxd3dKQnpwaVNPdGNNem1DVVZ6Q24wTDhqdlNXNkJPNkVNY3pQUHZHVWtJblhrbUFkMmhIWnhkejQ1cCsyNjhPNS9MazJTTmVKZ0JjUlFiOE5LR29DTjQ3WTdLWC9LUTQvaWM2VlVRcnJNZ3lrbGQ1NlF5VG8wd0Nad3M0NkFmSmdFRDRUTWdvWnZsSXJCaHdCTm94UU1vREFSWXhpWlR6dG1ialpZK2pNUkNEMjRtRk4yVmpxNHFhc205dU14UHFXZm5ha3FMTUlrRFNCeHhWdnkzVitqMTRHYUlHQXA0L28rUWZWYzZ2U0d0RVZyK2xMQ29OazVpbzB4TEJ6M0RoREFRSkw2RllxNHREV0JFdlpCUjhCeUhQcEN2cFBKdWxXQWZzMHVlcnpjaVh3VEF6U2tBd0Q1UExoaGtvUEs1THYxSnI5RWN6cnRhVHh2ZkZUbUg0c205bStLQklnR01JaFRuM3lGUUVaR3ZHT2lRd0Z6clBUME94L1UrSjNWRy9uQzE4bE5HdkRHSjd4YnpsMTVlWHZiTWN0OFB1UlMvWkpYbzNkZFVMM0xyWnk5dWlPQ2gzdjZzT2JmVllRRmF2N3daY0JqTEYvbUxIMEpwNmprWHI1VDJ2YVFVSk5FSmZvNStlZkxpeUc4bllKUkJsdEJ6S0Y0d0NZSkJFb21YWkVWdWNGVEcyd0JrSXNkRTZwWjNsYmxFUXJjRUV3ZXo3UGMxQ2QxTWFON3ZTZWhpbTZ2TzRvU2t1MHpkVjEzOHZMdTFQejUvSi9yT2RlRUQwTkVGSWNBSkFXYkFTdk12Mm5IZ2NuTENDZUljWHRhZjV2bGJCSVZDVnZTRmFibTlkZ2tRaHdsRFZNeE9qbmpyVjd5bUFIQzBhMTJZWUpieUhzTmc0TURZeWQ0RHZzMWVnY0kwUjdqTXZjWkpXeUh6Z1BhMHlwSkZlMXA5NFpiQzBXWEc3QkpBeDduY0NYQUpWaGp5a3ZkVnZxNkkyZW1DcjYwdXdRWG5jSEVKZk1SaXp1QkNLcGV6Y3NwSlhYMTVsOXd6K3NZbnJKL1F5dFRLZy9Kc1BOeEZxR2hEKy9lcTkvNzkyV2g1OGR2WnUrNVhWMzhyL0w4QUFBRC8vMFdpbmRsS1B3QUEiLCJsYWJlbHMiOnsibm9kZS5rdWJlcm5ldGVzLmlvL3JvbGUiOiJwZWFrLXdvcmtsb2FkcyJ9LCJ0YWludHMiOlt7ImVmZmVjdCI6Ik5vRXhlY3V0ZSIsImtleSI6Im5vZGUua3ViZXJuZXRlcy5pby9yb2xlIiwidmFsdWUiOiJwZWFrLXdvcmtsb2FkcyJ9XX19fQ==
                          - name: HCLOUD_SSH_KEY
                            value: '101582983'
                          - name: HCLOUD_IMAGE
                            value: '306553279'
                          - name: HCLOUD_NETWORK
                            value: '11402841'
                          - name: HCLOUD_FIREWALL
                            value: '2398924'
                          - name: HCLOUD_PUBLIC_IPV4
                            value: 'true'
                          - name: HCLOUD_PUBLIC_IPV6
                            value: 'true'
                          - name: HCLOUD_SERVER_CREATION_TIMEOUT
                            value: '15'
                          volumeMounts:
                            - name: ssl-certs
                              mountPath: /etc/ssl/certs
                              readOnly: true
                          imagePullPolicy: "Always"
                      volumes:
                        - name: ssl-certs
                          hostPath:
                            path: "/etc/ssl/certs" # right place on MicroOS?
            EOT -> (known after apply)
        }
    }

  # module.kube-hetzner.ssh_sensitive_resource.kubeconfig will be updated in-place
  ~ resource "ssh_sensitive_resource" "kubeconfig" {
        id                                 = "1162937576025028983"
      ~ private_key                        = (sensitive value)
        # (12 unchanged attributes hidden)
    }

  # module.kube-hetzner.module.control_planes["0-0-control-plane-hel1"].data.cloudinit_config.config will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                            >&2 echo "loop"
                            if (( "$SECONDS" > "$END_SECONDS" )); then
                                >&2 echo "timeout reached"
                                exit 1
                            fi
                            # run command and check return code
                            if $@ ; then
                                >&2 echo "break"
                                break
                            else
                                >&2 echo "got failure exit code, repeating"
                                sleep 0.5
                            fi
                        done
                    }
                
                    myrename () {
                        local eth="$1"
                        local eth_connection
                
                        # In case of a private-only network, eth0 may not exist
                        if ip link show "$eth" &>/dev/null; then
                            eth_connection=$(nmcli -g GENERAL.CONNECTION device show "$eth" || echo '')
                            nmcli connection modify "$eth_connection" \
                              con-name "$eth" \
                              connection.interface-name "$eth"
                        fi
                    }
                
                    myrepeat myrename eth0
                    myrepeat myrename eth1
                
                    systemctl restart NetworkManager
                  permissions: "0744"
                
                # Disable ssh password authentication
                - content: |
                    Port 22
                    PasswordAuthentication no
                    X11Forwarding no
                    MaxAuthTries 2
                    AllowTcpForwarding no
                    AllowAgentForwarding no
                    AuthorizedKeysFile .ssh/authorized_keys
                  path: /etc/ssh/sshd_config.d/kube-hetzner.conf
                
                # Set reboot method as "kured"
                - content: |
                    REBOOT_METHOD=kured
                  path: /etc/transactional-update.conf
                
                # Create Rancher repo config
                - content: |
                    [rancher-k3s-common-stable]
                    name=Rancher K3s Common (stable)
                    baseurl=https://rpm.rancher.io/k3s/stable/common/microos/noarch
                    enabled=1
                    gpgcheck=1
                    repo_gpgcheck=0
                    gpgkey=https://rpm.rancher.io/public.key
                  path: /etc/zypp/repos.d/rancher-k3s-common.repo
                
                # Create the kube_hetzner_selinux.te file, that allows in SELinux to not interfere with various needed services
                - path: /root/kube_hetzner_selinux.te
                  content: |
                    module kube_hetzner_selinux 1.0;
                
                    require {
                        type kernel_t, bin_t, kernel_generic_helper_t, iscsid_t, iscsid_exec_t, var_run_t, var_lib_t,
                            init_t, unlabeled_t, systemd_logind_t, systemd_hostnamed_t, container_t,
                            cert_t, container_var_lib_t, etc_t, usr_t, container_file_t, container_log_t,
                            container_share_t, container_runtime_exec_t, container_runtime_t, var_log_t, proc_t, io_uring_t, fuse_device_t, http_port_t,
                            container_var_run_t;
                        class key { read view };
                        class file { open read execute execute_no_trans create link lock rename write append setattr unlink getattr watch };
                        class sock_file { watch write create unlink };
                        class unix_dgram_socket create;
                        class unix_stream_socket { connectto read write };
                        class dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write watch };
                        class lnk_file { read create };
                        class system module_request;
                        class filesystem associate;
                        class bpf map_create;
                        class io_uring sqpoll;
                        class anon_inode { create map read write };
                        class tcp_socket name_connect;
                        class chr_file { open read write };
                    }
                
                    #============= kernel_generic_helper_t ==============
                    allow kernel_generic_helper_t bin_t:file execute_no_trans;
                    allow kernel_generic_helper_t kernel_t:key { read view };
                    allow kernel_generic_helper_t self:unix_dgram_socket create;
                
                    #============= iscsid_t ==============
                    allow iscsid_t iscsid_exec_t:file execute;
                    allow iscsid_t var_run_t:sock_file write;
                    allow iscsid_t var_run_t:unix_stream_socket connectto;
                
                    #============= init_t ==============
                    allow init_t unlabeled_t:dir { add_name remove_name rmdir search };
                    allow init_t unlabeled_t:lnk_file create;
                    allow init_t container_t:file { open read };
                    allow init_t container_file_t:file { execute execute_no_trans };
                    allow init_t fuse_device_t:chr_file { open read write };
                    allow init_t http_port_t:tcp_socket name_connect;
                
                    #============= systemd_logind_t ==============
                    allow systemd_logind_t unlabeled_t:dir search;
                
                    #============= systemd_hostnamed_t ==============
                    allow systemd_hostnamed_t unlabeled_t:dir search;
                
                    #============= container_t ==============
                    allow container_t { cert_t container_log_t }:dir read;
                    allow container_t { cert_t container_log_t }:lnk_file read;
                    allow container_t cert_t:file { read open };
                    allow container_t container_var_lib_t:dir { add_name remove_name write read create };
                    allow container_t container_var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t etc_t:dir { add_name remove_name write create setattr watch };
                    allow container_t etc_t:file { create setattr unlink write };
                    allow container_t etc_t:sock_file { create unlink };
                    allow container_t usr_t:dir { add_name create getattr link lock read rename remove_name reparent rmdir setattr unlink search write };
                    allow container_t usr_t:file { append create execute getattr link lock read rename setattr unlink write };
                    allow container_t container_file_t:file { open read write append getattr setattr lock };
                    allow container_t container_file_t:sock_file watch;
                    allow container_t container_log_t:file { open read write append getattr setattr watch };
                    allow container_t container_share_t:dir { read write add_name remove_name };
                    allow container_t container_share_t:file { read write create unlink };
                    allow container_t container_runtime_exec_t:file { read execute execute_no_trans open };
                    allow container_t container_runtime_t:unix_stream_socket { connectto read write };
                    allow container_t kernel_t:system module_request;
                    allow container_t var_log_t:dir { add_name write remove_name watch read };
                    allow container_t var_log_t:file { create lock open read setattr write unlink getattr };
                    allow container_t var_lib_t:dir { add_name remove_name write read create };
                    allow container_t var_lib_t:file { append create open read write rename lock setattr getattr unlink };
                    allow container_t proc_t:filesystem associate;
                    allow container_t self:bpf map_create;
                    allow container_t self:io_uring sqpoll;
                    allow container_t io_uring_t:anon_inode { create map read write };
                    allow container_t container_var_run_t:dir { add_name remove_name write };
                    allow container_t container_var_run_t:file { create open read rename unlink write };
                
                # Create the k3s registries file if needed
                
                # Create k3s registries file
                - content: IA==
                  encoding: base64
                  path: /etc/rancher/k3s/registries.yaml
                
                
                
                # Apply DNS config
                manage_resolv_conf: true
                resolv_conf:
                  nameservers:
                    - 1.1.1.1
                    - 8.8.8.8
                    - 2606:4700:4700::1111
                
                # Add ssh authorized keys
                ssh_authorized_keys:
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILaiupGNkw2Gzb6AcCtpB9OhYu55hBGF9qIjh6XDKj+Q runner@runner
                
                  - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPxx9gWelsnyCU+WJ95XovyNPgr3TYrByhOr54kl5ukV tonit@tonipc
                
                # Resize /var, not /, as that's the last partition in MicroOS image.
                growpart:
                    devices: ["/var"]
                
                # Make sure the hostname is set correctly
                hostname: k3s-control-plane-hel1-fas
                preserve_hostname: true
                
                runcmd:
                
                # ensure that /var uses full available disk size, thanks to btrfs this is easy
                - [btrfs, 'filesystem', 'resize', 'max', '/var']
                
                # SELinux permission for the SSH alternative port
                
                
                # Create and apply the necessary SELinux module for kube-hetzner
                - [checkmodule, '-M', '-m', '-o', '/root/kube_hetzner_selinux.mod', '/root/kube_hetzner_selinux.te']
                - ['semodule_package', '-o', '/root/kube_hetzner_selinux.pp', '-m', '/root/kube_hetzner_selinux.mod']
                - [semodule, '-i', '/root/kube_hetzner_selinux.pp']
                - [setsebool, '-P', 'virt_use_samba', '1']
                - [setsebool, '-P', 'domain_kernel_load_modules', '1']
                
                # Disable rebootmgr service as we use kured instead
                - [systemctl, disable, '--now', 'rebootmgr.service']
                
                # Bounds the amount of logs that can survive on the system
                - [sed, '-i', 's/#SystemMaxUse=/SystemMaxUse=3G/g', /etc/systemd/journald.conf]
                - [sed, '-i', 's/#MaxRetentionSec=/MaxRetentionSec=1week/g', /etc/systemd/journald.conf]
                
                # Reduces the default number of snapshots from 2-10 number limit, to 4 and from 4-10 number limit important, to 2
                - [sed, '-i', 's/NUMBER_LIMIT="2-10"/NUMBER_LIMIT="4"/g', /etc/snapper/configs/root]
                - [sed, '-i', 's/NUMBER_LIMIT_IMPORTANT="4-10"/NUMBER_LIMIT_IMPORTANT="3"/g', /etc/snapper/configs/root]
                
                # Allow network interface
                - [chmod, '+x', '/etc/cloud/rename_interface.sh']
                
                # Restart the sshd service to apply the new config
                - [systemctl, 'restart', 'sshd']
                
                # Make sure the network is up
                - [systemctl, restart, NetworkManager]
                - [systemctl, status, NetworkManager]
                
                # Cleanup some logs
                - [truncate, '-s', '0', '/var/log/audit/audit.log']
                
                # Add logic to truly disable SELinux if disable_selinux = true.
                # We'll do it by appending to cloudinit_runcmd_common.
                
                
                
                
                # Configure default routes based on public ip availability
                # Standard setup: eth0 is public, configure both IPv4 and IPv6
                - [ip, route, add, default, via, '172.31.1.1', dev, 'eth0', metric, '100']
                - [ip, -6, route, add, default, via, 'fe80::1', dev, 'eth0', metric, '100']
            EOT
          + content_type = "text/cloud-config"
          + filename     = "init.cfg"
        }
    }

  # module.kube-hetzner.module.control_planes["0-1-control-plane-hel1"].data.cloudinit_config.config will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #cloud-config
                
                write_files:
                
                # Script to rename the private interface to eth1 and unify NetworkManager connection naming
                - path: /etc/cloud/rename_interface.sh
                  content: |
                    #!/bin/bash
                    set -euo pipefail
                
                    sleep 11
                
                    # Somehow sometimes on private-ip only setups, the 
                    # interface may already be correctly names, and this
                    # block should be skipped.
                    if ! ip link show eth1; then
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      INTERFACE=$(ip link show | grep -v 'flannel' | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      if [ "$INTERFACE" = "eth1" ]; then
                        echo "Interface $INTERFACE already points to $MAC, skipping..."
                        exit 0
                      fi
                
                      # Take row beginning with 3 if exists, 2 otherwise (if only a private ip)
                      # WV REMOVE > INTERFACE=$(ip link show | awk 'BEGIN{l3=""}; /^3:/{l3=$2}; /^2:/{l2=$2}; END{if(l3!="") print l3; else print l2}' | sed 's/://g')
                      # WV REMOVE > MAC=$(cat /sys/class/net/$INTERFACE/address)
                
                      cat <<EOF > /etc/udev/rules.d/70-persistent-net.rules
                      SUBSYSTEM=="net", ACTION=="add", DRIVERS=="?*", ATTR{address}=="$MAC", NAME="eth1"
                    EOF
                
                      ip link set $INTERFACE down
                      ip link set $INTERFACE name eth1
                      ip link set eth1 up
                    fi
                
                    myrepeat () {
                        # Current time + 300 seconds (5 minutes)
                        local END_SECONDS=$((SECONDS + 300))
                        while true; do
                       
…
```
</details>
<!-- placeholder-5 -->
<!-- terraform-15-d4f15006c8c98d4f78a2c306b3d58885.tfplan -->
<!-- placeholder-6 -->